grevaillot/svd_tools/headers/STM32H7x7_CM4/gpioj.h
/** @defgroup gpioj_gpio_bsrr GPIOBSRR GPIO port bit set/reset register
@{*/

/** GPIOJ_GPIO_BSRR_BR15 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR15		(1 << 31)
/** GPIOJ_GPIO_BSRR_BR14 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR14		(1 << 30)
/** GPIOJ_GPIO_BSRR_BR13 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR13		(1 << 29)
/** GPIOJ_GPIO_BSRR_BR12 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR12		(1 << 28)
/** GPIOJ_GPIO_BSRR_BR11 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR11		(1 << 27)
/** GPIOJ_GPIO_BSRR_BR10 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR10		(1 << 26)
/** GPIOJ_GPIO_BSRR_BR9 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR9		(1 << 25)
/** GPIOJ_GPIO_BSRR_BR8 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR8		(1 << 24)
/** GPIOJ_GPIO_BSRR_BR7 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR7		(1 << 23)
/** GPIOJ_GPIO_BSRR_BR6 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR6		(1 << 22)
/** GPIOJ_GPIO_BSRR_BR5 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR5		(1 << 21)
/** GPIOJ_GPIO_BSRR_BR4 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR4		(1 << 20)
/** GPIOJ_GPIO_BSRR_BR3 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR3		(1 << 19)
/** GPIOJ_GPIO_BSRR_BR2 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR2		(1 << 18)
/** GPIOJ_GPIO_BSRR_BR1 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR1		(1 << 17)
/** GPIOJ_GPIO_BSRR_BR0 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_GPIO_BSRR_BR0		(1 << 16)
/** GPIOJ_GPIO_BSRR_BS15 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS15		(1 << 15)
/** GPIOJ_GPIO_BSRR_BS14 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS14		(1 << 14)
/** GPIOJ_GPIO_BSRR_BS13 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS13		(1 << 13)
/** GPIOJ_GPIO_BSRR_BS12 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS12		(1 << 12)
/** GPIOJ_GPIO_BSRR_BS11 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS11		(1 << 11)
/** GPIOJ_GPIO_BSRR_BS10 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS10		(1 << 10)
/** GPIOJ_GPIO_BSRR_BS9 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS9		(1 << 9)
/** GPIOJ_GPIO_BSRR_BS8 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS8		(1 << 8)
/** GPIOJ_GPIO_BSRR_BS7 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS7		(1 << 7)
/** GPIOJ_GPIO_BSRR_BS6 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS6		(1 << 6)
/** GPIOJ_GPIO_BSRR_BS5 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS5		(1 << 5)
/** GPIOJ_GPIO_BSRR_BS4 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS4		(1 << 4)
/** GPIOJ_GPIO_BSRR_BS3 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS3		(1 << 3)
/** GPIOJ_GPIO_BSRR_BS2 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS2		(1 << 2)
/** GPIOJ_GPIO_BSRR_BS1 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS1		(1 << 1)
/** GPIOJ_GPIO_BSRR_BS0 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_GPIO_BSRR_BS0		(1 << 0)

/**@}*/

/** @defgroup gpioj_gpio_lckr GPIOLCKR This register is used to lock the configuration of the port bits when a correct write sequence is applied to bit 16 (LCKK). The value of bits [15:0] is used to lock the configuration of the GPIO. During the write sequence, the value of LCKR[15:0] must not change. When the LOCK sequence has been applied on a port bit, the value of this port bit can no longer be modified until the next MCU reset or peripheral reset.A specific write sequence is used to write to the GPIOx_LCKR register. Only word access (32-bit long) is allowed during this locking sequence.Each lock bit freezes a specific configuration register (control and alternate function registers).
@{*/

